Tekla Open API Reference for Tekla Structures 2025
Events.DrawingChanged Event
 The DrawingChanged event is raised when the drawing has been changed and the database is committed.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DrawingStatusChangedDelegate DrawingChanged
Public Event DrawingChanged As Events.DrawingStatusChangedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingStatusChangedDelegate
Implements
IEvents.DrawingChanged
See Also
Reference
Events Class
Tekla.Structures.Drawing Namespace